app/controllers/assets_controller.rb

SELECT * FROM "assets" LIMIT 1
---
  def index
    @assets = Asset.all