app/controllers/employees_controller.rb

SELECT * FROM "employees"
---
  def index
    @employees = Employee.all

SELECT * FROM "employees" WHERE ("employees"."id" = 1)
---
  def show
    @employee = Employee.find(params[:id])

SELECT * FROM "employees" WHERE ("employees"."id" = 1)
---
  def edit
    @employee = Employee.find(params[:id])

INSERT INTO "employees" ("name", "start_date", "end_date", "office_id", "updated_at", "manager_id", "created_by", "type", "updated_by", "title_id", "status_id", "department_id", "legal_name", "remote", "created_at") VALUES('Charles Hicks', NULL, NULL, 0, '2009-06-15 22:39:51', 0, NULL, NULL, NULL, 0, NULL, 0, 'Carl Hicks', 'f', '2009-06-15 22:39:51')
---
  def create
    @employee = Employee.new(params[:employee])

    respond_to do |format|
      if @employee.save

SELECT * FROM "employees" WHERE ("employees"."id" = 1)
---
  def update
    @employee = Employee.find(params[:id])

SELECT * FROM "employees" WHERE ("employees"."id" = 1)
DELETE FROM "employees" WHERE "id" = 1
---
  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy